---
permalink: /patents/
title: "Chinese Patents"
author_profile: true
redirect_from: 
  - /patents.html
  - /patent/
  - /patent.html
---

When I worked at Insititude of Quantum Computing, Baidu Reasearch, I applied for the following patents in China. Those patents ending in B have been granted, while patents ending in A have been published.

1. 晋力京，**陈俣翱**，陈立鹏，“量子芯片、量子计算机以及制造方法"，CN116796847B.

1. **陈俣翱**，“量子电路的模拟方法、装置、设备及存储介质"，CN116415669B.

1. **陈俣翱**，晋力京，“量子芯片结构及量子芯片结构的版图生成方法"，CN116384496B.

1. **陈俣翱**，陈建萧，刘树森，“周期性旋转量子门的标定方法及装置、电子设备和介质"，CN115936135B.

1. **陈俣翱**，“处理参数的确定方法、装置、设备以及存储介质"，CN115829040B.

1. **陈俣翱**，孙文赟，刘树森，“特征信息的确定方法、装置、设备以及存储介质"，CN115759269B.

1. 汪景波，**陈俣翱**, “量子门生成方法、装置、电子设备和介质"，CN115329966B.

1. **陈俣翱**，晋力京，“连通特征确定方法、装置、设备及存储介质"，CN114943199B.

1. 晋力京，**陈俣翱**，“量子芯片结构及确定方法、装置、设备、存储介质"，CN114819164B.

1. **陈俣翱**，段润尧，“数字签名方法、签名信息的验证方法、相关装置及电子设备"，CN113407976B.

1. **陈俣翱**，段润尧，“数字签名方法、签名信息的验证方法、相关装置及电子设备"，CN113407975B.

1. 王琨，**陈俣翱**，王鑫，“量子设备去噪方法和装置、电子设备、计算机可读介质"，CN113298262B.

1. **陈俣翱**，刘树森，王宁烽，“量子门标定方法及装置、电子设备和介质"，CN113128691B.

1. **陈俣翱**，段润尧，晋力京，“数字签名方法、签名信息的验证方法、相关装置及电子设备"，CN113098691B.

1. 王琨，**陈俣翱**，王鑫，“消除量子测量噪声的方法及系统、电子设备和介质"，CN113011593B.

1. **陈俣翱**，段润尧，晋力京，“数字签名方法、签名信息的验证方法、相关装置及电子设备"，CN112560091B.

1. **陈俣翱**，刘树森，吕申进，“量子芯片的子芯片的确定方法、装置及电子设备"，CN118114778A.

1. **陈俣翱**，刘树森，吕申进，“量子芯片的子芯片的确定方法、装置及电子设备"，CN118095466A.

1. **陈俣翱**，刘树森，“量子芯片的刻画方法、装置、电子设备及存储介质"，CN118095465A.

1. **陈俣翱**，刘树森，吕申进，“量子芯片的子芯片的确定方法、装置及电子设备"，CN118095464A.

1. **陈俣翱**，刘树森，吕申进，“量子芯片的子芯片的确定方法、装置及电子设备"，CN118095463A.

1. 汪景波，**陈俣翱**，刘树森，“量子随机数生成方法、装置、设备、系统及存储介质"，CN116820401A.

